The  BuiltInFailures StructuralAssetFailures  type exposes the following members.
 Properties
Name  |   Description
StructuralMaterialAssetInvalid
 Material assigned to the Analytical Element does not contain Structure parameters - verify material content.
 See Also
  BuiltInFailures StructuralAssetFailures Class
  Autodesk.Revit.DB Namespace